if len_w > 2 && endsWith(uword,{'ΑΓΑ','ΑΓΕΣ','ΑΓΕ'})
    r31=cat(1,r31,termList{word_number});
    
    len_suffix=endsWith(uword,{'ΑΓΑ','ΑΓΕΣ','ΑΓΕ'});
    
    uword(len_w-(len_suffix-1) : end)=[];
    
    if ismember(uword,{'ΑΒΑΣΤ','ΠΟΛΥΦ','ΑΔΗΦ','ΠΑΜΦ','Ρ','ΑΣΠ','ΑΦ','ΑΜΑΔ','ΑΜΑΛΛΙ','ΑΝΥΣΤ','ΑΠΕΡ'...
            'ΑΣΠΑΡ','ΑΧΑΡ','ΔΕΡΒΕΝ','ΔΡΟΣΟΠ','ΞΕΦ','ΝΕΟΠ','ΝΟΜΟΤ','ΟΛΟΠ','ΟΜΟΤ','ΠΡΟΣΤ','ΠΡΟΣΩΠΟΠ'...
            'ΣΥΜΠ','ΣΥΝΤ','Τ','ΥΠΟΤ','ΧΑΡ','ΑΕΙΠ','ΑΙΜΟΣΤ','ΑΝΥΠ','ΑΠΟΤ','ΑΡΤΙΠ','ΔΙΑΤ','ΕΝ','ΕΠΙΤ'...
            'ΚΡΟΚΑΛΟΠ','ΣΙΔΗΡΟΠ','Λ','ΝΑΥ','ΟΥΛΑΜ','ΟΥΡ','Π','ΤΡ','Μ','ΟΦ','ΠΕΛ','ΧΟΡΤ','ΛΛ','ΣΦ','ΡΠ','ΦΡ','ΠΡ','ΛΟΧ','ΣΜΗΝ'})...
            || ( endsWith(uword,{'ΟΦ','ΠΕΛ','ΧΟΡΤ','ΛΛ','ΣΦ','ΡΠ','ΦΡ','ΠΡ','ΛΟΧ','ΣΜΗΝ'}) &&...
            ~ismember(uword,{'ΨΟΦ','ΝΑΥΛΟΧ'}) && ~endsWith(uword,{'ΚΟΛΛ'}))
        
        uword=cat(2,uword,'ΑΓ');
    end
    
    if cap_spots(1)==0
        stems=cat(1,stems,cat(2,upper(uword(1)),lower(uword(2:end))));
    else
        stems = cat(1,stems,lower(uword));
    end
    
    continue;
end

