
if len_w > 2 && endsWith(uword,{'ΙΖΑ','ΙΖΕΣ','ΙΖΕ','ΙΖΑΜΕ','ΙΖΑΤΕ','ΙΖΑΝ','ΙΖΑΝΕ','ΙΖΩ','ΙΖΕΙΣ','ΙΖΕΙ','ΙΖΟΥΜΕ','ΙΖΕΤΕ','ΙΖΟΥΝ','ΙΖΟΥΝΕ'})
    r2=cat(1,r2,termList{word_number});
    
    len_suffix=endsWith(uword,{'ΙΖΑ','ΙΖΕΣ','ΙΖΕ','ΙΖΑΜΕ','ΙΖΑΤΕ','ΙΖΑΝ','ΙΖΑΝΕ','ΙΖΩ','ΙΖΕΙΣ','ΙΖΕΙ','ΙΖΟΥΜΕ','ΙΖΕΤΕ','ΙΖΟΥΝ','ΙΖΟΥΝΕ'});
    
    uword(len_w-(len_suffix-1) : end)=[];
    
    if endsWith(uword,{'ΑΝΑΜΠΑ','ΕΜΠΑ','ΕΠΑ','ΞΑΝΑΠΑ','ΠΑ','ΠΕΡΙΠΑ','ΑΘΡΟ','ΣΥΝΑΘΡΟ','ΔΑΝΕ'}) || ismember(uword,{'ΑΝΑΜΠΑ','ΕΜΠΑ','ΕΠΑ','ΞΑΝΑΠΑ','ΠΑ','ΠΕΡΙΠΑ','ΑΘΡΟ','ΣΥΝΑΘΡΟ','ΔΑΝΕ'})
        uword = cat(2,uword,'Ι');
    
    elseif endsWith(uword,{'ΠΙΠΕΡΟΡ','ΓΛΥΚΟΡ','ΓΛΥΚΥΡ','ΒΟΛΒΟΡ','ΒΑΘΥΡΙ','ΑΜΠΑΡ','ΠΟΛΥΡ','ΜΑΡΚ','ΚΟΡΝ','ΒΑΡΚ','ΜΑΡ','ΜΠΡ','ΓΚΡ','ΑΡΡ','ΙΜΠ','ΛΟΥ','ΠΡ','Β','Λ','Μ','Π','Ρ'})...
            || ismember(uword,{'ΜΑΡΚ','ΚΟΡΝ','ΑΜΠΑΡ','ΑΡΡ','ΒΑΘΥΡΙ','ΒΑΡΚ','Β','ΒΟΛΒΟΡ','ΓΚΡ','ΓΛΥΚΟΡ','ΓΛΥΚΥΡ','ΙΜΠ','Λ','ΛΟΥ','ΜΑΡ','Μ','ΠΡ','ΜΠΡ','ΠΟΛΥΡ','Π','Ρ','ΠΙΠΕΡΟΡ'})
        
        uword = cat(2,uword,'ΙΖ');
    end
    
    if cap_spots(1)==0
        stems=cat(1,stems,cat(2,upper(uword(1)),lower(uword(2:end))));
    else
        stems = cat(1,stems,lower(uword));
    end
    
    continue;
end

