
if len_w > 2 && endsWith(uword,{'ΙΣΑ','ΙΣΕΣ','ΙΣΕ','ΙΣΑΜΕ','ΙΣΑΤΕ','ΙΣΑΝ','ΙΣΑΝΕ'})
    r4=cat(1,r4,termList{word_number});

    len_suffix=endsWith(uword,{'ΙΣΑ','ΙΣΕΣ','ΙΣΕ','ΙΣΑΜΕ','ΙΣΑΤΕ','ΙΣΑΝ','ΙΣΑΝΕ'});
    
    uword(len_w-(len_suffix-1) : end)=[];
    if endsWith(uword,{'ΑΝΑΜΠΑ','ΑΘΡΟ','ΕΜΠΑ','ΕΣΕ','ΕΣΩΚΛΕ','ΕΠΑ','ΞΑΝΑΠΑ','ΠΕΡΙΠΑ','ΣΥΝΑΘΡΟ'...
            'ΔΑΝΕ','ΧΑΡΤΟΠΑ','ΕΞΑΡΧΑ','ΜΕΤΕΠΕ','ΑΠΟΚΛΕ','ΑΠΕΚΛΕ','ΕΚΛΕ','ΕΠΕ','ΚΛΕ','ΠΕ'})...
            || ismember(uword,{'ΑΝΑΜΠΑ','ΑΘΡΟ','ΕΜΠΑ','ΕΣΕ','ΕΣΩΚΛΕ','ΕΠΑ','ΞΑΝΑΠΑ','ΕΠΕ','ΠΕΡΙΠΑ','ΣΥΝΑΘΡΟ'...
            'ΔΑΝΕ','ΚΛΕ','ΧΑΡΤΟΠΑ','ΕΞΑΡΧΑ','ΜΕΤΕΠΕ','ΑΠΟΚΛΕ','ΑΠΕΚΛΕ','ΕΚΛΕ','ΠΕ'})
        uword = cat(2,uword,'Ι');
        
    elseif  ismember(uword,{'ΑΝ','ΑΦ','ΓΕ','ΓΙΓΑΝΤΟΑΦ','ΓΚΕ','ΔΗΜΟΚΡΑΤ','ΚΟΜ','ΓΚ','Μ','Π','ΠΟΥΚΑΜ','ΟΛΟ','ΛΑΡ'})
        uword = cat(2,uword,'ΙΣ');
    end
    
    if cap_spots(1)==0
        stems=cat(1,stems,cat(2,upper(uword(1)),lower(uword(2:end))));
    else
        stems = cat(1,stems,lower(uword));
    end
    
    continue;
end

